import React from 'react';
//Import scss
import '../styles/Containers/Section6_Footer.scss'

//Import Images
import logoBackgroundWhite from '@logos/logo-background-white.png';

function Section6_Footer() {
    return (
        <footer className="sectionFooter">

            <div className="Footer__box1">
                <div className="Footer__box1-logo">
                    <img src={logoBackgroundWhite} alt="logo de Empresa QB" />
                </div>

                <div className="Footer__box1-datos">
                    <div className="Footer__box1_SobreNosotros">
                        <span>SOBRE NOSOTROS</span>
                        <p>Somos una empresa dedicada a la creación de productos y accesorios personalizados, tanto físicos como digitales, diseñados para ofrecer a cada cliente una experiencia única, creativa y de alta calidad. Apostamos por la innovación constante, el desarrollo de nuevos productos y la expansión del negocio a través de canales virtuales y sucursales físicas. Nuestro compromiso es ingresar con fuerza al mundo digital, posicionándonos como una agencia líder en personalización, reconocida por su profesionalismo, dinamismo y capacidad para adaptarse a las necesidades cambiantes del mercado.</p>
                    </div>
                    <div className="Footer__box1_OtherInfo">
                        <div className="Footer__OtherInfo">
                            <div className="Footer__OtherInfo_RedesSociales">
                                <span>¡SÍGUENOS EN NUESTRAS REDES SOCIALES!</span>
                                <div className="RedesSociales_icons">
                                    <div className="RedesSociales_Facebook" >
                                        <a href="https://www.facebook.com/EMPRESAQB">
                                            <svg
                                                xmlns="http://www.w3.org/2000/svg"
                                                width="40"
                                                height="40"
                                                fill="none"
                                                viewBox="0 0 40 40"
                                            >
                                                <path
                                                    fill="#fff"
                                                    d="M37.969.469H2.03A1.56 1.56 0 00.47 2.03V37.97A1.56 1.56 0 002.03 39.53H37.97a1.56 1.56 0 001.562-1.562V2.03A1.56 1.56 0 0037.97.47zM33.457 11.87h-3.12c-2.446 0-2.92 1.162-2.92 2.871v3.765h5.84l-.762 5.893h-5.078v15.132h-6.089V24.404h-5.093v-5.898h5.093V14.16c0-5.044 3.081-7.793 7.583-7.793 2.158 0 4.009.161 4.55.235v5.268h-.004z"
                                                ></path>
                                            </svg>
                                        </a>
                                    </div>
                                    <div className="RedesSociales_Instagram">
                                        <a href="https://www.instagram.com/illusion.qb/">
                                            <svg
                                                xmlns="http://www.w3.org/2000/svg"
                                                width="42"
                                                height="48"
                                                fill="none"
                                                viewBox="0 0 42 48"
                                            >
                                                <g clipPath="url(#clip0_450_575)">
                                                    <path
                                                        fill="#fff"
                                                        d="M21 19a5 5 0 10.003 10A5 5 0 0021 19zm11.692-3.844a5.063 5.063 0 00-2.851-2.851c-1.97-.777-6.657-.603-8.841-.603-2.184 0-6.867-.181-8.842.603a5.063 5.063 0 00-2.85 2.85c-.777 1.97-.603 6.662-.603 8.844 0 2.183-.174 6.87.606 8.844a5.063 5.063 0 002.851 2.851c1.969.778 6.656.603 8.842.603 2.185 0 6.866.181 8.84-.603a5.063 5.063 0 002.851-2.85c.783-1.97.603-6.662.603-8.844 0-2.183.18-6.868-.603-8.843l-.003-.001zM21 31.688A7.688 7.688 0 1128.688 24 7.678 7.678 0 0121 31.688zm8.004-13.904a1.794 1.794 0 111.794-1.794 1.792 1.792 0 01-1.79 1.798l-.004-.004zM37.5 3h-33A4.5 4.5 0 000 7.5v33A4.5 4.5 0 004.5 45h33a4.5 4.5 0 004.5-4.5v-33A4.5 4.5 0 0037.5 3zm-1.605 27.188c-.12 2.402-.67 4.531-2.423 6.28-1.755 1.75-3.882 2.31-6.282 2.424-2.476.14-9.899.14-12.375 0-2.402-.12-4.524-.67-6.28-2.423-1.758-1.753-2.31-3.883-2.424-6.282-.14-2.476-.14-9.9 0-12.375.12-2.402.662-4.531 2.423-6.28 1.76-1.75 3.888-2.303 6.281-2.418 2.476-.14 9.9-.14 12.375 0 2.403.121 4.531.67 6.282 2.424 1.75 1.753 2.309 3.883 2.423 6.286.14 2.467.14 9.885 0 12.363z"
                                                    ></path>
                                                </g>
                                                <defs>
                                                    <clipPath id="clip0_450_575">
                                                        <path fill="#fff" d="M0 0H42V48H0z"></path>
                                                    </clipPath>
                                                </defs>
                                            </svg>
                                        </a>
                                    </div>
                                    <div className="RedesSociales_Youtube">
                                        <a href="https://www.youtube.com/@Empresaqb21">
                                            <svg width="45" height="44" viewBox="0 0 45 45" fill="none" xmlns="http://www.w3.org/2000/svg">
                                                <path d="M28.782 19.0547L20.529 13.1147C20.0444 12.766 19.495 12.5827 18.9359 12.5832C18.3768 12.5837 17.8276 12.768 17.3434 13.1176C16.8593 13.4672 16.4572 13.9698 16.1775 14.575C15.8978 15.1802 15.7504 15.8667 15.75 16.5656V28.44C15.7432 29.8631 16.3508 31.1794 17.3385 31.8825C17.8228 32.2361 18.3734 32.423 18.9343 32.4239C19.4951 32.4249 20.0462 32.24 20.5312 31.8881L28.782 25.9481C29.2667 25.5998 29.6693 25.0979 29.9493 24.493C30.2293 23.8881 30.3767 23.2017 30.3767 22.5028C30.3767 21.804 30.2293 21.1175 29.9493 20.5126C29.6693 19.9077 29.2667 19.4058 28.782 19.0575V19.0547ZM27.657 23.5041L19.4085 29.4469C19.2656 29.5517 19.1028 29.607 18.9371 29.607C18.7714 29.607 18.6087 29.5517 18.4657 29.4469C18.3227 29.3457 18.204 29.1983 18.1221 29.0202C18.0402 28.8421 17.998 28.6398 18 28.4344V16.5656C17.9984 16.3607 18.0408 16.1589 18.1227 15.9814C18.2046 15.8038 18.3231 15.6569 18.4657 15.5559C18.6074 15.4481 18.7701 15.3911 18.936 15.3911C19.1019 15.3911 19.2646 15.4481 19.4062 15.5559L27.657 21.4988C27.7993 21.5992 27.9177 21.7451 28.0001 21.9215C28.0824 22.0979 28.1259 22.2985 28.1259 22.5028C28.1259 22.7071 28.0824 22.9077 28.0001 23.0841C27.9177 23.2605 27.7993 23.4036 27.657 23.5041ZM38.25 0H6.75C4.96034 0.00223373 3.24449 0.891899 1.979 2.47375C0.71352 4.05561 0.00178698 6.20042 0 8.4375V36.5625C0.00178698 38.7996 0.71352 40.9444 1.979 42.5262C3.24449 44.1081 4.96034 44.9978 6.75 45H38.25C40.0397 44.9978 41.7555 44.1081 43.021 42.5262C44.2865 40.9444 44.9982 38.7996 45 36.5625V8.4375C44.9982 6.20042 44.2865 4.05561 43.021 2.47375C41.7555 0.891899 40.0397 0.00223373 38.25 0ZM42.75 36.5625C42.7482 38.0537 42.2735 39.4831 41.43 40.5375C40.5865 41.5919 39.4429 42.1853 38.25 42.1875H6.75C5.55707 42.1853 4.41352 41.5919 3.56999 40.5375C2.72646 39.4831 2.25179 38.0537 2.25 36.5625V8.4375C2.25179 6.94634 2.72646 5.5169 3.56999 4.46249C4.41352 3.40808 5.55707 2.81473 6.75 2.8125H38.25C39.4429 2.81473 40.5865 3.40808 41.43 4.46249C42.2735 5.5169 42.7482 6.94634 42.75 8.4375V36.5625Z" fill="white" />
                                            </svg>


                                        </a>
                                    </div>
                                    <div className="RedesSociales_Tiktok">
                                        <a href="https://www.tiktok.com/@empresaqb">
                                            <svg
                                                xmlns="http://www.w3.org/2000/svg"
                                                width="46"
                                                height="46"
                                                fill="none"
                                                viewBox="0 0 46 46"
                                            >
                                                <path
                                                    stroke="#fff"
                                                    strokeLinecap="round"
                                                    strokeLinejoin="round"
                                                    strokeWidth="2.5"
                                                    d="M44.25 13.194v19.112A11.945 11.945 0 0132.306 44.25H13.194A11.944 11.944 0 011.25 32.306V13.194A11.944 11.944 0 0113.194 1.25h19.112A11.945 11.945 0 0144.25 13.194z"
                                                ></path>
                                                <path
                                                    stroke="#fff"
                                                    strokeLinecap="round"
                                                    strokeLinejoin="round"
                                                    strokeWidth="3.125"
                                                    d="M18.03 22.867a7.225 7.225 0 107.226 7.225V8.417c.802 2.408 3.853 7.225 9.633 7.225"
                                                ></path>
                                            </svg>
                                        </a>
                                    </div>
                                </div>
                            </div>
                            <div className="Footer__OtherInfo_Ubicación">
                                <span>NUESTRA UBICACIÓN</span>
                                <div className="OtherInfo_Location">

                                    <svg width="27" height="39" viewBox="0 0 27 39" fill="none"
                                        xmlns="http://www.w3.org/2000/svg">
                                        <path
                                            d="M13.5 19.6762C14.4281 19.6762 15.2229 19.2906 15.8844 18.5193C16.5459 17.748 16.8761 16.8219 16.875 15.741C16.875 14.6588 16.5442 13.7321 15.8827 12.9607C15.2212 12.1894 14.427 11.8044 13.5 11.8057C12.5719 11.8057 11.7771 12.1914 11.1156 12.9627C10.4541 13.734 10.1239 14.6601 10.125 15.741C10.125 16.8232 10.4558 17.7499 11.1173 18.5213C11.7788 19.2926 12.573 19.6776 13.5 19.6762ZM13.5 38.6146C13.275 38.6146 13.05 38.5654 12.825 38.4671C12.6 38.3687 12.4031 38.2375 12.2344 38.0735C8.12812 33.8431 5.0625 29.9158 3.0375 26.2914C1.0125 22.667 0 19.2814 0 16.1345C0 11.2155 1.35731 7.29661 4.07194 4.37797C6.78656 1.45932 9.92925 0 13.5 0C17.0719 0 20.2151 1.45932 22.9297 4.37797C25.6444 7.29661 27.0011 11.2155 27 16.1345C27 19.2827 25.9875 22.669 23.9625 26.2934C21.9375 29.9177 18.8719 33.8445 14.7656 38.0735C14.5969 38.2375 14.4 38.3687 14.175 38.4671C13.95 38.5654 13.725 38.6146 13.5 38.6146Z"
                                            fill="white" />
                                    </svg>

                                    <a href="https://goo.gl/maps/236DkeE3Mw1xFoSt9">Jirón Arequipa 623, Tarma 12651</a>
                                </div>
                            </div>
                        </div>
                        <div className="Footer__OtherInfo_Contactos">
                            <span>CONTÁCTANOS</span>
                            <div className="Other_Form_Contacts">
                                <div className="Contact_Call">
                                    <div className="Contact_Whatssapp">
                                        <div className="Footer_Whatsapp_icon">
                                            <svg width="42" height="45" viewBox="0 0 42 45" fill="none"
                                                xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M35.6875 6.78307C33.7775 4.73799 31.5024 3.1165 28.9951 2.01318C26.4877 0.909864 23.7981 0.346796 21.0833 0.356821C9.70831 0.356821 0.43748 10.1839 0.43748 22.2414C0.43748 26.106 1.39581 29.8602 3.18748 33.1727L0.270813 44.5235L11.2083 41.476C14.2291 43.2206 17.625 44.1481 21.0833 44.1481C32.4583 44.1481 41.7292 34.321 41.7292 22.2635C41.7292 16.4114 39.5833 10.9127 35.6875 6.78307ZM21.0833 40.4381C18 40.4381 14.9791 39.5547 12.3333 37.8985L11.7083 37.501L5.20831 39.3118L6.93748 32.5985L6.52081 31.9139C4.80778 29.0143 3.89819 25.6626 3.89581 22.2414C3.89581 12.2156 11.6041 4.04474 21.0625 4.04474C25.6458 4.04474 29.9583 5.94391 33.1875 9.38891C34.7864 11.076 36.0535 13.0827 36.9154 15.2927C37.7772 17.5027 38.2167 19.8721 38.2083 22.2635C38.25 32.2893 30.5416 40.4381 21.0833 40.4381ZM30.5 26.8347C29.9791 26.5697 27.4375 25.2447 26.9791 25.046C26.5 24.8693 26.1666 24.781 25.8125 25.311C25.4583 25.8631 24.4791 27.0997 24.1875 27.4531C23.8958 27.8285 23.5833 27.8727 23.0625 27.5856C22.5416 27.3206 20.875 26.7243 18.9166 24.8693C17.375 23.4118 16.3541 21.6231 16.0416 21.071C15.75 20.5189 16 20.2318 16.2708 19.9447C16.5 19.7018 16.7916 19.3043 17.0416 18.9952C17.2916 18.686 17.3958 18.4431 17.5625 18.0897C17.7291 17.7143 17.6458 17.4052 17.5208 17.1402C17.3958 16.8752 16.3541 14.181 15.9375 13.0768C15.5208 12.0168 15.0833 12.1493 14.7708 12.1272H13.7708C13.4166 12.1272 12.875 12.2597 12.3958 12.8118C11.9375 13.3639 10.6041 14.6889 10.6041 17.3831C10.6041 20.0772 12.4583 22.6831 12.7083 23.0364C12.9583 23.4118 16.3541 28.9327 21.5208 31.2956C22.75 31.8697 23.7083 32.201 24.4583 32.4439C25.6875 32.8635 26.8125 32.7972 27.7083 32.6647C28.7083 32.5102 30.7708 31.3397 31.1875 30.0589C31.625 28.7781 31.625 27.696 31.4791 27.4531C31.3333 27.2102 31.0208 27.0997 30.5 26.8347Z"
                                                    fill="white" />
                                            </svg>
                                        </div>
                                        <a href="https://api.whatsapp.com/send?phone=%2B51930820893&data=AWBSqMg4WzEBzFb9AQi6eaXVGIZqMY3c5GbM9Z3xG6Qs7Twqm8AGZjicA2Ek9p53xbm14G94hdb5tUu5Vft63hGOg5HLgwLxE-8FI2QjMSgragCmqfnEiWyylY8ELwszI0Bz2Xkm9ATgepGlWqY2SH6bHB-j05w7HUNbnDraGXOhu4ZpaetRlytP3IPEnLQnot4i4Y19gR6kAmx9BxAPk7s12S08H405_YRtqPG27hvt5b0WS5YZQhX-njcUpIfCMdQ0MbwlPQoJJkpXLvSIlb_9Osz9IFpaYpifezsM-_GHSiyYFOE&source=FB_Page&app=facebook&entry_point=page_cta&fbclid=IwAR12t0uprByw4ZrFJ6gc0ThMNi_HzAeVvg8XKM8ZBVyowI7jZ2aVaMWeqU8"> 930 820 893 </a>
                                    </div>
                                    <div className="Contact_Mobile">
                                        <div className="Footer_Mobile_icon">
                                            <svg width="33" height="35" viewBox="0 0 33 35" fill="none"
                                                xmlns="http://www.w3.org/2000/svg">
                                                <path
                                                    d="M30.8512 24.1299C28.6475 24.1299 26.5154 23.7549 24.5267 23.0799C24.2151 22.9693 23.8801 22.9529 23.56 23.0325C23.24 23.1121 22.9478 23.2845 22.7171 23.5299L19.9042 27.2236C14.8337 24.6924 10.0858 19.9111 7.55958 14.4174L11.0533 11.3049C11.5371 10.7799 11.6804 10.0486 11.4833 9.39236C10.8204 7.31111 10.48 5.07986 10.48 2.77361C10.48 1.76111 9.67375 0.917358 8.70625 0.917358H2.50708C1.53958 0.917358 0.375 1.36736 0.375 2.77361C0.375 20.1924 14.2246 34.6674 30.8512 34.6674C32.1233 34.6674 32.625 33.4861 32.625 32.4549V25.9861C32.625 24.9736 31.8187 24.1299 30.8512 24.1299Z"
                                                    fill="white" />
                                            </svg>

                                        </div>
                                        <a> 955 404 270</a>
                                    </div>
                                </div>
                                <div className="Contact_Outlook">
                                    <div className="Outlook_icon">
                                        <svg width="44" height="38" viewBox="0 0 44 38" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M39.5843 10.0222L22.3843 21.5732L5.18428 10.0222V5.40177L22.3843 16.9528L39.5843 5.40177M39.5843 0.781372H5.18428C2.79778 0.781372 0.884277 2.83745 0.884277 5.40177V33.1242C0.884277 34.3496 1.33731 35.5248 2.14372 36.3913C2.95012 37.2578 4.04385 37.7446 5.18428 37.7446H39.5843C40.7247 37.7446 41.8184 37.2578 42.6248 36.3913C43.4312 35.5248 43.8843 34.3496 43.8843 33.1242V5.40177C43.8843 4.17636 43.4312 3.00115 42.6248 2.13466C41.8184 1.26816 40.7247 0.781372 39.5843 0.781372Z" fill="white" />
                                        </svg>
                                    </div>
                                    <a href="mailto:miguel_bqb@outlook.es">miguel_bqb@outlook.es</a>
                                </div>
                                <div className="Contact_Gmail">
                                    <div className="Gmail_icon">
                                        <svg width="44" height="32" viewBox="0 0 44 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M43.7289 3.20295V28.8462C43.7289 30.3014 42.5665 31.4105 41.0414 31.4105H38.3539V8.13799L22.2289 19.1902L6.10388 8.13799V31.4105H3.41638C1.89123 31.4105 0.728882 30.3014 0.728882 28.8462V3.20295C0.728882 2.47468 1.01644 1.8336 1.49885 1.37972C1.7501 1.13986 2.04932 0.950652 2.37873 0.82334C2.70814 0.696029 3.06102 0.633213 3.41638 0.638628H4.31266L22.2289 13.0333L40.1451 0.638628H41.0414C41.8046 0.638628 42.4765 0.913011 42.9589 1.37972C43.4413 1.8336 43.7289 2.47468 43.7289 3.20295Z" fill="white" />
                                        </svg>

                                    </div>
                                    <a href="mailto:qbcorporacion@gmail.com">qbcorporacion@gmail.com</a>
                                </div>
                            </div>
                        </div>

                    </div>
                </div>
            </div>

            <div className="Footer__box2">
                <span>&copy; 2025 <b>EMPRESA QB</b> - Todos los derechos reservados</span>
            </div>
        </footer>

    );
}


export default Section6_Footer;